----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
           QConv2d-1           [-1, 32, 32, 32]             864
       BatchNorm2d-2           [-1, 32, 32, 32]              64
             ReLU6-3           [-1, 32, 32, 32]               0
           QConv2d-4           [-1, 32, 30, 30]           9,216
       BatchNorm2d-5           [-1, 32, 30, 30]              64
             ReLU6-6           [-1, 32, 30, 30]               0
           QConv2d-7           [-1, 64, 30, 30]           2,048
       BatchNorm2d-8           [-1, 64, 30, 30]             128
             ReLU6-9           [-1, 64, 30, 30]               0
DepthSeperabelConv2d-10           [-1, 64, 30, 30]               0
          QConv2d-11           [-1, 64, 14, 14]          36,864
      BatchNorm2d-12           [-1, 64, 14, 14]             128
            ReLU6-13           [-1, 64, 14, 14]               0
          QConv2d-14            [-1, 128, 7, 7]           8,192
      BatchNorm2d-15            [-1, 128, 7, 7]             256
            ReLU6-16            [-1, 128, 7, 7]               0
DepthSeperabelConv2d-17            [-1, 128, 7, 7]               0
          QConv2d-18            [-1, 128, 5, 5]         147,456
      BatchNorm2d-19            [-1, 128, 5, 5]             256
            ReLU6-20            [-1, 128, 5, 5]               0
          QConv2d-21           [-1, 1024, 5, 5]         131,072
      BatchNorm2d-22           [-1, 1024, 5, 5]           2,048
            ReLU6-23           [-1, 1024, 5, 5]               0
DepthSeperabelConv2d-24           [-1, 1024, 5, 5]               0
          QConv2d-25           [-1, 1024, 2, 2]       9,437,184
      BatchNorm2d-26           [-1, 1024, 2, 2]           2,048
            ReLU6-27           [-1, 1024, 2, 2]               0
          QConv2d-28           [-1, 1024, 1, 1]       1,048,576
      BatchNorm2d-29           [-1, 1024, 1, 1]           2,048
            ReLU6-30           [-1, 1024, 1, 1]               0
DepthSeperabelConv2d-31           [-1, 1024, 1, 1]               0
AdaptiveAvgPool2d-32           [-1, 1024, 1, 1]               0
          QLinear-33                   [-1, 10]          10,240
================================================================
Total params: 10,838,752
Trainable params: 10,838,752
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 4.63
Params size (MB): 41.35
Estimated Total Size (MB): 45.99
